Дошкольное_учреждение83/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/CommonModules/удуОбработкаТабличнойЧастиТМЦПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТАВКАМИ НДС

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Возврат 0.1;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Возврат 0.18;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции // ПолучитьСтавкуНДСЧислом()
